app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Computer Science"], ["room_number", 5], ["created_at", "2019-08-12 17:51:28.965213"], ["updated_at", "2019-08-12 17:51:28.965213"]]
---
    def create
        @school_class = SchoolClass.create(school_params)

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2019-08-12 18:11:40.583147"], ["id", 1]]
---
    def update
        @school_class = SchoolClass.find(params[:id])
        @school_class.update(school_params)